DataProcessors/EDR_ЧтениеDIFF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>EDR_ЧтениеDIFF</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/EDR_ТипDiversCode.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>EDR_ТипDiversCode</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>P</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>M</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/EDR_ВидыРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>EDR_ВидыРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MinAgeDay</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MaxAgeDay</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_CF</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_TAPV</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_NewV</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_EC</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_Part</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_MD</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_Comm1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_Comm2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_Comm3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_Indicator</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_DiverPart</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_DiverOper</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Control_CustomerReq</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/EDR_ЧтениеDIFF/Ext/ObjectModule.bsl
Процедура ОбработкаНаСервере() Экспорт
	
	ПрочитатьФайлы();
	
КонецПроцедуры

Процедура ПрочитатьФайлы() Экспорт
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) тогда Возврат КонецЕсли;
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКФайлу);
	
	КоличествоСтрок = ТекстДок.КоличествоСтрок();
	
	СтрокиDEP = Новый Массив;
	СтрокиNDP = Новый Массив;
	СтрокиDIV = Новый Массив;
	
	СтрокиПроизводителя = Новый Массив;
	СтрокиEC = Новый Массив;
	СтрокиMD = Новый Массив;
	
	//Каждую строку проверяем на идентификатор 
	//Это первые три (GARNAD) или два (GARFOU) символа
	Для Сч = 1 по КоличествоСтрок Цикл
		ТекстСтрока = ТекстДок.ПолучитьСтроку(Сч);
		
		Если НЕ Найти(ВРег(ТекстСтрока),"*S*") = 0 тогда Продолжить КонецЕсли; //Это заголовочная строка
		Если НЕ Найти(ВРег(ТекстСтрока),",") = 0 тогда Продолжить КонецЕсли; //Это продолжение заголовка
		
		//GARNAD
		Метка = ВРЕГ(Лев(ТекстСтрока, 3));
		Если Метка = "DEP" тогда
			
			СтруктураDEP = РазложитьDEP(ТекстСтрока);
			СтрокиDEP.Добавить(СтруктураDEP);
			
			Продолжить;
		ИначеЕсли Метка = "NDP" тогда
			
			СтруктураNDP = РазложитьNDP(ТекстСтрока);
			СтрокиNDP.Добавить(СтруктураNDP);
			
			Продолжить;
		ИначеЕсли Метка = "DIV" тогда
			
			СтруктураDIV = РазложитьDIV(ТекстСтрока);
			СтрокиDIV.Добавить(СтруктураDIV);
			Продолжить;
		КонецЕсли;
		
		//GARFOU
		Метка = ВРЕГ(Лев(ТекстСтрока, 2));
		Если Метка = "EC" тогда //Жалоба клиента
			
			СтруктураEC = РазложитьEC(ТекстСтрока);
			СтрокиEC.Добавить(СтруктураEC);
			Продолжить;
		ИначеЕсли Метка = "MD" тогда //Комментарий клиента
			
			СтруктураMD = РазложитьMD(ТекстСтрока);
			СтрокиMD.Добавить(СтруктураMD);
			Продолжить;
		Иначе //Производители
			
			//Производителей не загружаем. Они не нужны более
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	//Код расходов
	РезультатЗаписиDEP = Справочники.EDR_ВидыРасходов.СоздатьЭлементыПоСписку(СтрокиDEP);
	РезультатЗаписиNDP = Справочники.EDR_ВидыРасходов.СоздатьЭлементыПоСписку(СтрокиNDP);
	РезультатЗаписиDIV = Справочники.EDR_DiversCode.СоздатьПричиныПоСписку(СтрокиDIV);
	
	РезультатЗаписиEC = Справочники.EDR_КодыОщущенийКлиента.СоздатьКодыПоСписку(СтрокиEC);
	РезультатЗаписиMD = Справочники.EDR_КодыКомментариевКлиента.СоздатьКодыПоСписку(СтрокиMD);
	
КонецПроцедуры

Функция РазложитьDEP(СтрокаИсточник)
	
	СтруктураDEP = Новый Структура;
	
	СтруктураDEP.Вставить("ExpenceCode", Сред(СтрокаИсточник, 4, 3));
	СтруктураDEP.Вставить("Type", "vehicle");
	СтруктураDEP.Вставить("MinAgeDay", Число(Сред(СтрокаИсточник, 7, 4)));
	СтруктураDEP.Вставить("MaxAgeDay", Число(Сред(СтрокаИсточник, 11, 4)));
	СтруктураDEP.Вставить("Control_TAPV", Булево(Число(Сред(СтрокаИсточник, 15, 1)))); //Ложь - все, Истина только из OPERACODE
	СтруктураDEP.Вставить("Control_NewV", Булево(Число(Сред(СтрокаИсточник, 16, 1))));
	СтруктураDEP.Вставить("Control_OCODE", Булево(Число(Сред(СтрокаИсточник, 17, 1))));
	СтруктураDEP.Вставить("Control_EC", Булево(Число(Сред(СтрокаИсточник, 18, 1))));
	СтруктураDEP.Вставить("Control_Part", Булево(Число(Сред(СтрокаИсточник, 19, 1))));
	СтруктураDEP.Вставить("Control_CF", Булево(Число(Сред(СтрокаИсточник, 20, 1))));
	СтруктураDEP.Вставить("Control_MD", Булево(Число(Сред(СтрокаИсточник, 21, 1))));
	СтруктураDEP.Вставить("Control_Comm1", Булево(Число(Сред(СтрокаИсточник, 22, 1))));
	СтруктураDEP.Вставить("Control_Comm2", Булево(Число(Сред(СтрокаИсточник, 23, 1))));
	СтруктураDEP.Вставить("Control_Comm3", Булево(Число(Сред(СтрокаИсточник, 24, 1))));
	СтруктураDEP.Вставить("Control_Indicator", Булево(Число(Сред(СтрокаИсточник, 25, 1))));
	СтруктураDEP.Вставить("Control_DiverPart", Булево(Число(Сред(СтрокаИсточник, 26, 1))));
	СтруктураDEP.Вставить("Control_DiverOper", Булево(Число(Сред(СтрокаИсточник, 27, 1))));
	СтруктураDEP.Вставить("Control_CustomerReq", Булево(Число(Сред(СтрокаИсточник, 28, 1))));
	
	Возврат СтруктураDEP;
	
КонецФункции

Функция РазложитьNDP(СтрокаИсточник)
	
	СтруктураNDP = Новый Структура;
	
	СтруктураNDP.Вставить("ExpenceCode", Сред(СтрокаИсточник, 4, 3));
	СтруктураNDP.Вставить("Type", "Parts");
	СтруктураNDP.Вставить("MinAgeDay", Число(Сред(СтрокаИсточник, 7, 4)));
	СтруктураNDP.Вставить("MaxAgeDay", Число(Сред(СтрокаИсточник, 11, 4)));
	
	Возврат СтруктураNDP;
	
КонецФункции

Функция РазложитьDIV(СтрокаИсточник)
	
	СтруктураDIV = Новый Структура;
	
	СтруктураDIV.Вставить("DiversCode", Сред(СтрокаИсточник, 4, 2));
	СтруктураDIV.Вставить("НаименованиеВФайле", Сред(СтрокаИсточник, 6, 15));
	СтруктураDIV.Вставить("Тип", ?(Сред(СтрокаИсточник, 21, 1) = "P", Перечисления.EDR_ТипDiversCode.P,Перечисления.EDR_ТипDiversCode.M));
	
	Возврат СтруктураDIV;
	
КонецФункции

Функция РазложитьEC(СтрокаИсточник)
	
	СтруктураEC = Новый Структура;
	
	СтруктураEC.Вставить("CustomerObjCode", Сред(СтрокаИсточник, 3, 2));
	СтруктураEC.Вставить("CustomerObjection", Сред(СтрокаИсточник, 5, 38));
	
	Возврат СтруктураEC;
	
КонецФункции

Функция РазложитьMD(СтрокаИсточник)
	
	СтруктураMD = Новый Структура;
	
	СтруктураMD.Вставить("CustomerCommCode", Сред(СтрокаИсточник, 3, 2));
	СтруктураMD.Вставить("CustomerComment", Сред(СтрокаИсточник, 5, 38));
	
	Возврат СтруктураMD;
	
КонецФункции
